In [1]:
import pandas as pd

In [2]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'age': [25, 30, 35, 40, 22],
    'city': ['Hanoi', 'HCM', 'Danang', 'Hanoi', 'HCM'],
    'salary': [500, 700, 800, 650, 550]
}
df = pd.DataFrame(data)

In [3]:
#hiển thị 3 dòng đầu tiên
df.name

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: name, dtype: object

In [4]:
#thống kê mô tả
df.describe(include="all")

         name        age   city      salary
count       5   5.000000      5    5.000000
unique      5        NaN      3         NaN
top     Alice        NaN  Hanoi         NaN
freq        1        NaN      2         NaN
mean      NaN  30.400000    NaN  640.000000
std       NaN   7.300685    NaN  119.373364
min       NaN  22.000000    NaN  500.000000
25%       NaN  25.000000    NaN  550.000000
50%       NaN  30.000000    NaN  650.000000
75%       NaN  35.000000    NaN  700.000000
max       NaN  40.000000    NaN  800.000000

In [5]:
# #lương cao nhất
df.loc[df["salary"].idxmax(), "name"]

'Charlie'

In [7]:
#lọc những người có mwucs lương ở HCM > 600
df.loc[(df.city == "HCM") & (df.salary > 600)]

  name  age city  salary
1  Bob   30  HCM     700

In [ ]:
#thuế 10%
df["tax"] = df["salary"] * 0.1
df

      name  age    city  salary   tax
0    Alice   25   Hanoi     500  50.0
1      Bob   30     HCM     700  70.0
2  Charlie   35  Danang     800  80.0
3    David   40   Hanoi     650  65.0
4      Eva   22     HCM     550  55.0

In [10]:
#sắp xếp tuổi
df.sort_values(by="age" , ascending=False)

      name  age    city  salary   tax
3    David   40   Hanoi     650  65.0
2  Charlie   35  Danang     800  80.0
1      Bob   30     HCM     700  70.0
0    Alice   25   Hanoi     500  50.0
4      Eva   22     HCM     550  55.0